Repository: peat-psuwit/libertine
Catalog: po/*.po
Languages: ru

source: Container app '{application_name}' is not valid.
ru: Приложение '{application_name}' в контейнере недействительно.

source: close detected on {socket}
ru: на {socket} пришёл сигнал закрытия

source: launching {launch_task}
ru: запускается {launch_task}

source: SIGCHLD received
ru: принят SIGCHLD

source: SIGINT received
ru: принят SIGINT

source: keyboard interrupt
ru: клавиатурное прерывание

source: SIGTERM received
ru: принят SIGTERM

source: terminate
ru: остановить

source: unknown signal {signal} received
ru: получен неизвестный сигнал {signal}

source: Launch an application natively or in a Libertine container
ru: Запустить приложение напрямую или в контейнере Libertine

source: Container identifier when launching containerized apps
ru: Идентификатор контейнера для запускаемых в нём приложений

source: Set an environment variable
ru: Установить переменную для среды

source: Launch an SSH session within a lxc/lxd Libertine container
ru: Запустить сессию SSH внутри lxc/lxd контейнера Libertine

source: Container identifier
ru: Идентификатор контейнера

source: Container username
ru: Название контейнера

source: Assume yes to all prompts
ru: Ответить "да" на все запросы

source: Configured identity file or public key matching '{}' do not exist.
ru: Сконфигурированный идентификатор или публичный ключ, соответствующий '{}', не существует.

source: It looks like no SSH keys are set up. Please generate a key and try again. You can use the following command to generate an appropriate key: ssh-keygen -t rsa -b 4096 -C 'your_email@example.com'
ru: Похоже, что ключи SSH не установлены. Пожалуйста, создайте ключ и попробуйте снова. Для создания ключа можно использовать следующую команду: ssh-keygen -t rsa -b 4096 -C 'your_email@example.com'

source: Always use '{}' as identity file and username '{}' when connecting to '{}'? [Yn]
ru: Всегда использовать идентификатор файла '{}' и имя пользователя '{}' при подсоединении к '{}'? [Да/нет]

source: Always use '{}' as identity file when connecting to '{}'? [Yn]
ru: Всегда использовать '{}' как идентификационный файл при подключении к '{}'? [Да/нет]

source: y
ru: да

source: openssh-server not detected in container '{}'. Install now? [Yn]
ru: openssh-server не найден в контейнере '{}'. Установить его сейчас? [Да/нет]

source: Failed to install openssh-server
ru: Не удалось установить openssh-server

source: Unable to get IP address for '{}'
ru: Не удалось получить IP-адрес для '{}'

source: OK to add public key '{}' to container '{}'? [Yn]
ru: Добавить публичный ключ '{}' в контейнер '{}'? [Да\нет]

source: Public key must be added to container to continue.
ru: Для продолжения нужно добавить в контейнер публичный ключ.

source: Failed to add public key to container's authorized keys.
ru: Не удалось добавить публичный ключ к списку авторизованных ключей контейнера.

source: No container with id '{container_id}'
ru: Нет контейнера с номером '{container_id}'

source: Container id '{container_id}' is already used.
ru: Номер контейнера id '{container_id}' уже используется.

source: Enter password for your user in the Libertine container or leave blank for no password:
ru: Введите пароль для своего пользователя в контейнере Libertine или оставьте пустым для использования без пароля:

source: Failed to create container
ru: Не удалось создать контейнер

source: Failed to create container: '{error}'
ru: Не удалось создать контейнер: '{error}'

source: {package_name} does not exist.
ru: {package_name} не существует.

source: Package '{package_name}' is already installed.
ru: Пакет '{package_name}' уже установлен.

source: Package '{package_name}' failed to install in container '{container_id}'
ru: Пакет '{package_name}' не удалось установить в контейнер '{container_id}'

source: Package '{package_name}' is not installed.
ru: Пакет '{package_name}' не установлен.

source: Package '{package_name}' failed to be removed from container '{container_id}'
ru: Пакет '{package_name}' не удалось удалить из контейнера '{container_id}'

source: i386 multiarch support is already {enabled_or_disabled}
ru: поддержка мультиархитектурности (multiarch) i386 уже {enabled_or_disabled}

source: Configure archive called with no archive name. See configure --help for usage.
ru: Попытка создания архива без указания имени файла. Запустите команду с ключом --help для справки и примеров использования.

source: {archive_name} already added in container.
ru: Архив {archive_name} уже добавлен в контейнер.

source: {archive_name} is not added in container.
ru: Архив {archive_name} не добавлен в контейнер.

source: Configure bind-mounts called without mount path. See configure --help for usage
ru: Попытка конфигурирования точки монтирования без указания соответствующих директорий. Запустите команду с ключом --help для справки и примеров использования

source: Cannot mount {mount_path}, mount path must be in {home_dir} or /media/{username}.
ru: Нельзя смонтировать {mount_path}, монтируемая директория должна находиться в {home_dir} или в /media/{username}.

source: /media mounts not currently supported in lxc.
ru: монтирование директории /media в lxc-контейнерах пока не поддерживается.

source: Cannot mount '{mount_path}', mount path must be an existing directory.
ru: Не получается смонтировать '{mount_path}', указанный путь должен вести в существующую папку.

source: Container cannot be restarted at this time. You will need to restart the container at a later time using the 'restart' subcommand.
ru: В текущий момент контейнер перезапустить нельзя. Вы можете перезапустить его позже подкомандой 'restart'.

source: Configure called with no subcommand. See configure --help for usage.
ru: Команда configure используется без подкоманд. Справку и примеры можно посмотреть по команде configure --help.

source: The restart subcommand is only valid for LXC and LXD type containers.
ru: Подкоманда restart работает только с LXC- и LXD-контейнерами.

source: Classic X application support for Unity 8
ru: Поддержка классических X-приложений для Unity 8

source: Please do not run '{program_name}' using sudo
ru: Пожалуйста, не запускайте '{program_name}' с помощью команды sudo

source: Create a new Libertine container.
ru: Создать новый контейнер Libertine.

source: Type of Libertine container to create. Either 'lxd', 'lxc' or 'chroot'.
ru: Тип создаваемого Libertine-контейнера. Три типа - 'lxd', 'lxc' или 'chroot'.

source: User friendly container name.
ru: Понятное пользователю название контейнера.

source: Force the installation of the given valid Ubuntu distro even if it is no longer supported.
ru: Принудительная инсталляция выбранного дистрибутива Ubuntu, даже если от уже не поддерживается.

source: Add i386 support to amd64 Libertine containers. This option has no effect when the Libertine container is i386.
ru: Добавить поддержку i386 контейнерам Libertine с архитектурой amd64. Эта опция не принесет никакого эффекта, когда контейнер Libertine уже имеет архитектуру i386.

source: Destroy any existing environment entirely.
ru: Полностью уничтожить любое существующее окружение.

source: Install a package or packages in the specified Libertine container.
ru: Установить пакет или несколько пакетов в указанный контейнер Libertine.

source: Name of package or full path to a Debian package. Multiple packages can be entered, separated by a space. Required.
ru: Название пакета или полный путь к пакету Debian. Можно указать несколько пакетов, разделив их через пробел. Обязательный параметр.

source: Remove a package in the specified Libertine container.
ru: Удалить пакет в указанном контейнере Libertine.

source: Name of package to remove. Multiple packages can be entered, separated by a space. Required.
ru: Имя пакета для удаления. Можно указать несколько пакетов, разделив их через пробел. Обязательный параметр.

source: String to search for in the package cache. Required.
ru: Строка для поиска в кэше пакета. Необходимый параметр.

source: Update the packages in the Libertine container. Also updates the container's locale and installs necessary language packs if the host's locale has changed.
ru: Обновить пакеты в контейнере Libertine. Также обновляется языковые настройки контейнера и устанавливаются необходимые языковые пакеты, если изменились языковые настройки хоста.

source: List all Libertine containers.
ru: Список всех контейнеров Libertine.

source: The command to run in the specified container.
ru: Команда для запуска в указанном контейнере.

source: Configure various options in the specified Libertine container.
ru: Настройка различных параметров в определённом контейнере Libertine.

source: Multiarch support
ru: Поддержка мультиархитектурности

source: Enable or disable multiarch support for a container.
ru: Включить или отключить поддержку мультиархитектурности в контейнере.

source: Enables or disables i386 multiarch support for amd64 Libertine containers. This option has no effect when the Libertine container is i386.
ru: Включить или отключить поддержку мультиархитектурности i386 для amd64-контейнеров. Опция не имеет эффекта для контейнеров c архитектурой i386.

source: Additional archive support
ru: Поддержка дополнительных архивов

source: Add or delete an additional archive (PPA).
ru: Добавить или удалить дополнительные архивы (PPA).

source: Adds or removes an archive (PPA) in the specified Libertine container.
ru: Добавить или удалить архив (PPA) в определённом контейнере Libertine.

source: Archive name
ru: Название архива

source: Archive name to be added or removed.
ru: Название архивного файла, который нужно добавить или удалить.

source: Public key file
ru: Файл с публичным ключом

source: File containing the key used to sign the given archive. Useful for third-party or private archives.
ru: Файл, содержащий ключ для подписи указанных архивов. Удобно для использования с файлами из посторонних источников.

source: Mount path
ru: Путь монтирования

source: Enable or disable freezing LXC/LXD containers when not in use.
ru: Включить или отключить "заморозку" LXC/LXD-контейнеров, когда они не используются.

source: Enables or disables freezing of LXC/LXD containers when not in use. When disabled, the container will stop.
ru: Включается или отключается "заморозка" LXC/LXD-контейнеров, когда они не используются. Если опция отключена, работа контейнера будет остановлена.

source: Container id
ru: Идентификатор контейнера

source: Restart a frozen Libertine container. This only works on LXC and LXD type containers.
ru: Перезапустить "замороженный" Libertine-контейнер. Работает только для LXC или LXD-контейнеров.
